CPU = \
    {
        'RaptorLake': '747|32302|807919|OR',
        'AlderLake': '747|32302|748297|OR',
        'Raphael': '747|32302|801673|OR',
        'Cezanne': '747|32302|740914|OR',
        'Vermeer': '747|32302|706786|OR',
        'Renoir': '747|32302|676055|OR'
    }

MainBoard = \
    {
        'Manufacturer':
            {
                'ASRock': '4503',
                'ASUS': '2869',
                'GIGABYTE': '3148',
                'MSI': '2904',
                'NZXT': '32917'
            },
        'Chipset':
            {
                'Intel_Z790': '751|504|808180|OR',
                'Intel_H770': '751|504|823273|OR',
                'Intel_B760': '751|504|823213|OR',
                'Intel_Z690': '751|504|748867|OR',
                'Intel_H670': '751|504|757636|OR',
                'Intel_B660': '751|504|757639|OR',
                'Intel_H610': '751|504|757642|OR',
                'AMD_X670E': '751|504|801685|OR',
                'AMD_X670': '751|504|801688|OR',
                'AMD_B650E': '751|504|801691|OR',
                'AMD_B650': '751|504|801694|OR',
                'AMD_A620': '751|504|845341|OR',
                'AMD_X570': '751|504|402965|OR',
                'AMD_B550': '751|504|671233|OR',
                'AMD_A520': '751|504|687766|OR'
            }
    }

RAM = \
    {
        'Manufacturer':
            {
                'ADATA': '4062',
                'Antec': '4423',
                'CORSAIR': '4127',
                'ESSENCORE': '92255',
                'G.SKILL': '4130',
                'GALAX': '31683',
                'GeIL': '4129',
                'GIGABYTE': '3148',
                'HP': '477',
                'Hynix': '4131',
                'Micron': '4156',
                'PATRIOT': '4137',
                'PNY': '4139',
                'SAMSUNG': '702',
                'Tammuz': '101515',
                'TeamGroup': '4142',
                'ThermalTake': '3186'
            },
        'Type':
            {
                'DDR4': '752|277|164333|OR',
                'DDR5': '752|277|748099|OR'
            }
    }

VGA = \
    {
        'Manufacturer':
            {
                'AMD': '3132',
                'ASRock': '4503',
                'ASUS': '2869',
                'COLORFUL': '41781',
                'EMTEK': '4527',
                'EVGA': '5408',
                'GAINWARD': '1491',
                'GALAX': '31683',
                'GIGABYTE': '3148',
                'INNO3D': '3436',
                'INTEL': '3156',
                'MANLI': '4545',
                'MSI': '2904',
                'PALIT': '26283',
                'PNY': '4139',
                'PowerColor': '4586',
                'SAPPHIRE': '5684',
                'XFX': '4030',
                'ZOTAC': '25800'
            },
        'GPU':
            {
                'RTX 4090': '753|658|805762|',
                'RTX 4080': '753|658|814180|',
                'RTX 4070 Ti': '753|658|823393|',
                'RTX 4070': '753|658|846919|OR',
                'RTX 4060 Ti': '753|658|863683|OR',
                'RTX 3090 Ti': '753|658|770506|',
                'RTX 3090': '753|658|693490|',
                'RTX 3080 Ti': '753|658|731872|',
                'RTX 3080': '753|658|693451|',
                'RTX 3070 Ti': '753|658|733036|',
                'RTX 3070': '753|658|705349|',
                'RTX 306O Ti': '753|658|709720|',
                'RTX 3060': '753|658|723391|',
                'RTX 3050': '753|658|761620|',
                'GTX 1660 Ti': '753|658|332302|OR',
                'GTX 1660S': '753|658|622280|OR',
                'GTX 1650S': '753|658|338797|OR',
                'GTX 1660': '753|658|624611|OR',
                'GTX 1650': '753|658|343624|OR',
                'GTX 1630': '753|658|786775|OR',
                'RX 7900 XTX': '753|657|818815|',
                'RX 7900 XT': '753|657|818818|',
                'RX 7600': '753|657|864124|OR',
                'RX 6950 XT': '753|657|777121|',
                'RX 6900 XT': '753|657|708859|',
                'RX 6800 XT': '753|657|708862|',
                'RX 6800': '753|657|708865|',
                'RX 6750 XT': '753|657|777124|',
                'RX 6700 XT': '753|657|726172|',
                'RX 6650 XT': '753|657|777127|',
                'RX 6600 XT': '753|657|741613|',
                'RX 6600': '753|657|746104|',
                'A770': '753|338008|838501|OR',
                'A750': '753|338008|838504|OR'
            }
    }

SSD = \
    {
        'Manufacturer':
            {
                '도시바': '3576',
                '마이크론': '4156',
                '삼성전자': '702',
                '솔리다임': '58405091',
                '인텔': '3156',
                '키오시아': '28939737',
                'CORSAIR': '4127',
                'ESSENCORE': '92255',
                'GIGABYTE': '3148',
                'MSI': '2904',
                'PNY': '4139',
                'Sabrent': '17652212',
                'Sandisk': '3466',
                'Seagate': '4202',
                'SK하이닉스': '4131',
                'TeamGroup': '4142',
                'WesternDigital': '4213'
            }
    }

HDD = \
    {
        "Manufacturer":
            {
                'HGST': '90815',
                'SEAGATE': '4202',
                'TOSHIBA': '3576',
                'WD': '4213'
            },
        "Type":
            {
                'DESKTOP': '4393',
                'LAPTOP': '4394',
                'NAS': '250884',
                'CCTV': '250885',
                'ENTERPRICE': '32109'
            }
    }

CHA = \
    {
        "Manufacturer":
            {
                '갤럭시': '31683',
                '리안리': '4192',
                '마이크로닉스': '3160',
                '써멀테이크': '3186',
                '아이구주': '103746',
                '앱코': '2108',
                '잘만': '3157',
                '쿨러마스터': '3134',
                'Antec': '4423',
                'ASUS': '2869',
                'bequiet': '91002',
                'BRAVOTEC': '57038',
                'CORSAIR': '4127',
                'COUGAR': '28016',
                'COX': '85226',
                'darkFlash': '15938410',
                'DAVEN': '111021',
                'FractalDesign': '58956',
                'HYDRA': '28899219',
                'HYTE': '51816518',
                'INWIN': '32921',
                'JONSBO': '117525',
                'MSI': '2904',
                'NZXT': '32917',
                'Phanteks': '77290',
                'Razer': '2324',
                'SilverStone': '5738',
                'SSUPD': '42845597',
                '3RSYS': '94456'
            }
    }

PSU = \
    {
        "Manufacturer":
            {
                '델타': '36977',
                '리안리': '4192',
                '마이크로닉스': '3160',
                '맥스엘리트': '105703',
                '시소닉': '4445',
                '써멀테이크': '3186',
                '앱코': '2108',
                '에너맥스': '3851',
                '에너지옵티머스': '113594',
                '잘만': '3157',
                'Antec': '4423',
                'AONE': '4295',
                'ASUS': '2869',
                'be_quiet': '91002',
                'CORSAIR': '4127',
                'DEEPCOOL': '51853',
                'EVGA': '5408',
                'Fractal_Design': '58956',
                'FSP': '4450',
                'GIGABYTE': '3148',
                'MSI': '2904',
                'NZXT': '32917',
                'SilverStone': '5738',
                'SuperFlower': '54524'
            },
        "Type":
            {
                'ATX': '777|1086|5529|OR',
                'SFX': '777|1086|5530|OR'
            }
    }
'''
COOLER = \
    {
        "Manufacturer":
            {
                'Noctua'
            }
        "Type":
            {
                '92mm'
            }
    }
'''
# Cleaning dist
list_dist = \
    [
        'STCOM', '코잇', '인텍앤컴퍼니', '아이보라',
        '피씨디렉트', '제이씨현', '디앤디컴', '에즈윈',
        '대원씨티에스', '서린', '아스크텍'
    ]